/********************************************Copyright******************************************************
**                                                                                                      
**
**-------------------------------------------文件信息-------------------------------------------------------
** 文件名称:			Wp_ADC.h
** 最后修订日期:  		2012-10-10
** 最后版本:			1.0
** 描述:				ADC初始化及模拟量数据处理文件;
**
**-----------------------------------------------------------------------------------------------------------
** 创建人:				吴康
** 创建日期:			2012-02-09
** 版本:				1.0
** 描述:				ADC初始化及模拟量数据处理文件;
**
**-----------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
**-----------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
*************************************************************************************************************/
#ifndef WP_ADC_H
#define WP_ADC_H


#include "stm32f10x.h"
#include "Wp_Globle.h"


/************************************************************************************************************
**                             函数声明
*************************************************************************************************************/
extern void Wp_AdcConfigure(void);					    // ADC配置初始化

extern u16 Wp_GetAdcChannelSamplingValue(u8 Channel);   // 获取ADC各通道采样值
extern int ADC_GetValue(u8 Channel);
extern float Wp_GetChannelAdcVoltageValue(u8 channel);  // 获取任意一个模拟输入端口电压值
extern float ADC_GetVoltage(u8 Channel);
extern void Wp_GetAdcVoltageValue(void);                // 获取所有模拟输入端口电压值

extern u16 Wp_AdcGetAllIO(void);					    // 获取IO采样值，返回16路IO状态，16位无符号整形每一位对应一路
extern u8 Wp_AdcGetIO(u8 channel);					    // 获取IO采样值，输入通道1~15，返回0或1

extern float Wp_FilterPower(void);                      // 电池电压滤波

extern u16 Wp_CalculateDistanceChannel(u8 channel);     // 计算红外传感器距离值
extern int Sensor_Distance(u8 Channel);
extern u16 Wp_CalculateLuxChannel(u8 channel);          // 计算光通量Lux值
extern int Sensor_Lux(u8 Channel);


#endif
/********************************************************************************************************
**                            End Of File
********************************************************************************************************/
