/*******************************************************Copyright*********************************************************

**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			Queue.h
** 最后修订日期:		2009-03-07
** 最后版本:			1.0
** 描述:				队列操作函数库，包含队列的结构定义、初始化、入队、出队等
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:				律晔
** 创建日期:			2009-03-07
** 版本:				1.0
** 描述:				队列操作函数库，包含队列的结构定义、初始化、入队、出队等
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:				律晔
** 修订日期:			2009-08-19
** 版本:				1.1
** 描述:				添加检查队列产度、状态功能
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
*************************************************************************************************************************/
#ifndef QUEUE_H_
#define QUEUE_H_


#include "ConfigTypes.h"
#include "CfgTypes.h"
#include <stdlib.h>


#define		QUEUE_GLOBALS

#ifndef   QUEUE_GLOBALS
     #define QUEUE_EXT     
#else 
     #define QUEUE_EXT  extern
#endif 


/*************************************************************************************************************************
 * 												结构体定义
*************************************************************************************************************************/
typedef struct SBufferQueue						// 定义缓冲队列结构
{
	uint8 state;								// 队列状态
	uint8 length;								// 队列长度

	uint8* init_address;						// 空间首地址

	uint8* front;								// 队头指针
	uint8* rear;								// 队尾指针
}BUFFER_QUEUE;


/*************************************************************************************************************************
                                                 函数声明
*************************************************************************************************************************/
extern void InitBufferQueue(BUFFER_QUEUE *p_buffer, uint8 length);
extern uint8 TestEmptyBufferQueue(BUFFER_QUEUE *p_buffer);
extern void AddBufferQueue(BUFFER_QUEUE *p_buffer, uint8 item);
extern uint8 OutBufferQueue(BUFFER_QUEUE *p_buffer, uint8 *item);
extern uint8 CheckBufferQueueLength(BUFFER_QUEUE *p_buffer);
extern uint8 CheckBufferQueueState(BUFFER_QUEUE *p_buffer);
extern void ClearBufferQueue(BUFFER_QUEUE *p_buffer);


/*************************************************************************************************************************
                                                 结构体外部声明
*************************************************************************************************************************/
QUEUE_EXT BUFFER_QUEUE str_rx_buffer;			// 建立接收缓冲区，UART1
QUEUE_EXT BUFFER_QUEUE ble_rx_buffer;           // 建立接收缓冲区，UART2
QUEUE_EXT BUFFER_QUEUE motor_rx_buffer;         // 建立接收缓冲区，UART3


#endif
/*************************************************************************************************************************
**                                                      文件结束
*************************************************************************************************************************/
