/********************************************Copyright******************************************************
**                                                                                                      
**
**-------------------------------------------文件信息-------------------------------------------------------
** 文件名称:			Wp_HallSensor.h
** 最后修订日期:  		2012-10-10
** 最后版本:			1.0
** 描述:				读取霍尔传感器相关函数;
**
**-----------------------------------------------------------------------------------------------------------
** 创建人:				吴康
** 创建日期:			2012-02-09
** 版本:				1.0
** 描述:				读取霍尔传感器相关函数;
**
**-----------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
**-----------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
*************************************************************************************************************/
#ifndef WP_HALLSENSOR_H
#define WP_HALLSENSOR_H


#include "stm32f10x.h"
#include "Wp_Globle.h"
#include "Wp_OLED.h"


/************************************************************************************************************
**                            	宏定义
*************************************************************************************************************/
// 传感器控制信号
#define Fir_CLK_L			GPIO_ResetBits(GPIOA, GPIO_Pin_1)
#define Fir_CLK_H			GPIO_SetBits(GPIOA, GPIO_Pin_1)
#define Fir_CS_L			GPIO_ResetBits(GPIOA, GPIO_Pin_0)
#define Fir_CS_H			GPIO_SetBits(GPIOA, GPIO_Pin_0)

#define Sec_CLK_L			GPIO_ResetBits(GPIOD, GPIO_Pin_12)
#define Sec_CLK_H			GPIO_SetBits(GPIOD, GPIO_Pin_12)
#define Sec_CS_L			GPIO_ResetBits(GPIOD, GPIO_Pin_11)
#define Sec_CS_H			GPIO_SetBits(GPIOD, GPIO_Pin_11)

#define Thi_CLK_L			GPIO_ResetBits(GPIOD, GPIO_Pin_14)
#define Thi_CLK_H			GPIO_SetBits(GPIOD, GPIO_Pin_14)
#define Thi_CS_L			GPIO_ResetBits(GPIOD, GPIO_Pin_13)
#define Thi_CS_H			GPIO_SetBits(GPIOD, GPIO_Pin_13)


/************************************************************************************************************
**                            	外部函数声明
*************************************************************************************************************/
void SendClk(u8 num);
u16 ReadPosition(u8 sensor_num);
void Wp_GetPositionValue(void);


#endif
/********************************************************************************************************
**                            End Of File
********************************************************************************************************/
